<a href="https://colab.research.google.com/github/t-abs/Apache-Spark/blob/main/Pyspark_10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Union VS UnionAll

In [49]:
from pyspark.sql import SparkSession

In [50]:
from pyspark.sql import SparkSession

# Create Spark session
spark = SparkSession.builder \
    .appName("Read CSV Example") \
    .getOrCreate()

In [60]:
data=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17)]
schema=['id','Name','Salary','Age']
manager_df=spark.createDataFrame(data=data,schema=schema)
manager_df.show()

+---+------+------+---+
| id|  Name|Salary|Age|
+---+------+------+---+
| 10|  Anil| 50000| 18|
| 11| Vikas| 75000| 16|
| 12| Nisha| 40000| 18|
| 13| Nidhi| 60000| 17|
| 14| Priya| 80000| 18|
| 15| Mohit| 45000| 18|
| 16|Rajesh| 90000| 10|
| 17| Raman| 55000| 16|
| 18|   Sam| 65000| 17|
+---+------+------+---+

In [62]:
data1=[(19 ,'Sohan',50000, 18),
(20 ,'Sima',75000,  17)]
schema=['id','Name','Salary','Age']
manager_df1=spark.createDataFrame(data=data1,schema=schema)
manager_df1.show()

+---+-----+------+---+
| id| Name|Salary|Age|
+---+-----+------+---+
| 19|Sohan| 50000| 18|
| 20| Sima| 75000| 17|
+---+-----+------+---+

In [74]:
manager_df.union(manager_df1).show()

+---+------+------+---+
| id|  Name|Salary|Age|
+---+------+------+---+
| 10|  Anil| 50000| 18|
| 11| Vikas| 75000| 16|
| 12| Nisha| 40000| 18|
| 13| Nidhi| 60000| 17|
| 14| Priya| 80000| 18|
| 15| Mohit| 45000| 18|
| 16|Rajesh| 90000| 10|
| 17| Raman| 55000| 16|
| 18|   Sam| 65000| 17|
| 18|   Sam| 65000| 17|
| 19| Sohan| 50000| 18|
| 20|  Sima| 75000| 17|
+---+------+------+---+

In [64]:
manager_df.union(manager_df1).count()

11

In [65]:
manager_df.unionAll(manager_df1).count()

11

In [69]:
data=[(10 ,'Anil',50000, 18),
(11 ,'Vikas',75000,  16),
(12 ,'Nisha',40000,  18),
(13 ,'Nidhi',60000,  17),
(14 ,'Priya',80000,  18),
(15 ,'Mohit',45000,  18),
(16 ,'Rajesh',90000, 10),
(17 ,'Raman',55000, 16),
(18 ,'Sam',65000,   17),
(18 ,'Sam',65000,   17)]

schema=['id','Name','Salary','Age']
manager_dp=spark.createDataFrame(data=data,schema=schema)
manager_dp.show()
#duplicate

+---+------+------+---+
| id|  Name|Salary|Age|
+---+------+------+---+
| 10|  Anil| 50000| 18|
| 11| Vikas| 75000| 16|
| 12| Nisha| 40000| 18|
| 13| Nidhi| 60000| 17|
| 14| Priya| 80000| 18|
| 15| Mohit| 45000| 18|
| 16|Rajesh| 90000| 10|
| 17| Raman| 55000| 16|
| 18|   Sam| 65000| 17|
| 18|   Sam| 65000| 17|
+---+------+------+---+

In [70]:
manager_dp.union(manager_df).count()

20

In [71]:
manager_dp.unionAll(manager_df).count()

20

In [72]:
manager_df1.createOrReplaceGlobalTempView("manager_dftbl")
manager_dp.createOrReplaceGlobalTempView("manager_dptbl")

In [76]:
spark.sql(
    "select * from global_temp.manager_dftbl UNION select * from global_temp.manager_dptbl"
).count()

11

In [79]:
spark.sql(
    "select * from global_temp.manager_dftbl UNION ALL select * from global_temp.manager_dptbl"
).count()

12

Note-

In Data Frame there is no difference in union and union all

whearas in spark SQL Union All contains all duplicate and Union drops duplicate records

In [82]:
wrong_column_data=[(19 ,50000, 18,'Sohan'),
(20 ,75000,  17,'Sima')]
schema=['id','Salary','Name','Age']
wrong_df=spark.createDataFrame(data=data,schema=schema)
wrong_df.show()

+---+------+-----+---+
| id|Salary| Name|Age|
+---+------+-----+---+
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
+---+------+-----+---+

In [83]:
wrong_column_data=[(19 ,50000, 18,'Sohan',10),
(20 ,75000,  17,'Sima',20)]
wrong_df1=spark.createDataFrame(data=data,schema=schema)
wrong_df1.show()

+---+------+-----+---+
| id|Salary| Name|Age|
+---+------+-----+---+
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
+---+------+-----+---+

In [85]:
wrong_df.union(wrong_df1).show()

+---+------+-----+---+
| id|Salary| Name|Age|
+---+------+-----+---+
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
+---+------+-----+---+

In [86]:
wrong_df.unionByName(wrong_df1).show()

+---+------+-----+---+
| id|Salary| Name|Age|
+---+------+-----+---+
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
| 10|  Anil|50000| 18|
| 11| Vikas|75000| 16|
| 12| Nisha|40000| 18|
| 13| Nidhi|60000| 17|
| 14| Priya|80000| 18|
| 15| Mohit|45000| 18|
| 16|Rajesh|90000| 10|
| 17| Raman|55000| 16|
| 18|   Sam|65000| 17|
| 18|   Sam|65000| 17|
+---+------+-----+---+

If the no of columns are mismatching then it will give analysis exception error

Example

In [90]:
wrong_column_data = [
    (19, 50000,  'Sohan'),
    (20, 75000, 'Sima')
]

schema = ['id', 'Salary', 'Name']

wrong_df = spark.createDataFrame(wrong_column_data, schema=schema)
wrong_df.show()

+---+------+-----+
| id|Salary| Name|
+---+------+-----+
| 19| 50000|Sohan|
| 20| 75000| Sima|
+---+------+-----+

In [91]:
correct_data = [
    (19, 'Sohan', 18, 50000),
    (20, 'Sima', 17, 75000)
]

correct_schema = ['id', 'Name', 'Age', 'Salary']

correct_df = spark.createDataFrame(correct_data, correct_schema)
correct_df.show()

+---+-----+---+------+
| id| Name|Age|Salary|
+---+-----+---+------+
| 19|Sohan| 18| 50000|
| 20| Sima| 17| 75000|
+---+-----+---+------+

In [92]:
wrong_df.union(correct_df).show()

AnalysisException: [NUM_COLUMNS_MISMATCH] UNION can only be performed on inputs with the same number of columns, but the first input has 3 columns and the second input has 4 columns. SQLSTATE: 42826;
'Union false, false
:- LogicalRDD [id#1161L, Salary#1162L, Name#1163], false
+- LogicalRDD [id#1174L, Name#1175, Age#1176L, Salary#1177L], false